//CHKBALPR PROC FROMACCT=
//*
//* Step to Check Balance
//CHKBLNCE EXEC PGM=CHKBLNCE,PARM='FROMACCT=&FROMACCT'
//STEPLIB  DD DSN=YOUR.LIB,DISP=SHR
//*
//* End of Procedure
